app/controllers/answers_controller.rb

SELECT `projects`.* FROM `projects`
---
  def project_select
    @projects = Project.all

SELECT `questions`.* FROM `questions`
SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 1) LIMIT 1
---
  def answer_questions
    @questions = Question.all
    @answer = Answer.new
    @project = Project.find_by_id(params['answer']['project_id']);

INSERT INTO `answers` (`answer`, `created_at`, `project_id`, `question_id`, `updated_at`) VALUES ('--- \n- \"1\"\n- answer 1\n', '2011-02-18 16:16:30', 1, 0, '2011-02-18 16:16:30')
---
  def save_answers
    puts params.inspect
    params['question_ids'].each do |answer|
      puts answer.inspect
      values = {:question_id => answer[0],:answer => answer[1], :project_id => params['project_id']}
      Answer.new(values).save

SELECT `questions`.* FROM `questions`
SELECT `projects`.* FROM `projects`
SELECT questions.question, answers.* FROM `answers` join questions on questions.question_id = answers.question_id WHERE (`answers`.`project_id` = 1) GROUP BY answers.question_id ORDER BY answers.question_id
---
  def index
    @questions = Question.all
    @projects = Project.all
    if(params['answer']['project_id'])
      @answers = Answer.select("questions.question, answers.*").joins("join questions on questions.id = answers.question_id").where(:project_id => params['answer']['project_id']).order("answers.question_id")

SELECT `answers`.* FROM `answers` WHERE (`answers`.`id` = 0) LIMIT 1
---
  def show
    @answer = Answer.find(params[:id])

INSERT INTO `answers` (`answer`, `created_at`, `project_id`, `question_id`, `updated_at`) VALUES (NULL, '2011-02-18 16:39:26', 1, NULL, '2011-02-18 16:39:26')
---
  def create
    @answer = Answer.new(params[:answer])

    respond_to do |format|
      if @answer.save