app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 1) LIMIT 1

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`created_at`, `end_date`, `name`, `start_date`, `updated_at`) VALUES ('2011-02-18 14:48:54', '2011-02-18', 'Sweet Speeches', '2011-02-18', '2011-02-18 14:48:54')