app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE (`questions`.`id` = 1) LIMIT 1
---
  def show
    @question = Question.find(params[:id])

INSERT INTO `questions` (`created_at`, `question`, `updated_at`) VALUES ('2011-02-18 14:48:13', 'test question', '2011-02-18 14:48:13')
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save